/* eslint-disable */
/*
* 后端服务生成，不可修改
* */
const Code = {
    
    /*
    * 公告状态
    * */
    ANNOUNCE_STATUS: {
        /* 未发布 -  */
        '_0': '0',
        /* 已发布 -  */
        '_1': '1',
    },

    /*
    * 码表枚举匹配状态
    * */
    CODE_MODIFY_STATUS: {
        /* 枚举新增 - success */
        '_1': '1',
        /* 枚举修改 - warning */
        '_2': '2',
        /* 已同步数据 - green */
        '_3': '3',
        /* 枚举未改动 - black */
        '_4': '4',
        /* 仅存在码表 - gray */
        '_5': '5',
    },

    /*
    * 部门类型
    * */
    DEPARTMENT_TYPE: {
        /* 管理部门 -  */
        '_1': '1',
        /* 监督检查部门 -  */
        '_2': '2',
        /* 生产技术部门 -  */
        '_3': '3',
        /* 洗选检验部门 -  */
        '_4': '4',
        /* 安全部门 -  */
        '_5': '5',
        /* 管理类分管领导 -  */
        '_6': '6',
        /* 技术类分管领导 -  */
        '_7': '7',
        /* 领导班子 -  */
        '_8': '8',
    },

    /*
    * 错误代码
    * */
    ERROR_CODE: {
        /* 用户会话状态失效，请重新登录！ -  */
        '_1000': '1000',
    },

    /*
    * 文件上传类型
    * */
    FILE_BIZ_TYPE: {
        /* 管理制度 -  */
        '_1': '1',
    },

    /*
    * 启用状态
    * */
    IS_ACTIVE: {
        /* 启用 -  */
        '_1': '1',
        /* 禁用 -  */
        '_0': '0',
    },

    /*
    * 角色类型
    * */
    ROLE_TYPE: {
        /* 超级管理员 -  */
        '_01': '01',
        /* 普通管理员 -  */
        '_02': '02',
        /* 普通用户 -  */
        '_09': '09',
    },

    /*
    * 是否
    * */
    YES_NO: {
        /* 是 -  */
        '_1': '1',
        /* 否 -  */
        '_0': '0',
    },

};

export default Code;
